# 1. Читання та виведення даних:
# Зчитайте дані з JSON файлу та виведіть на екран інформацію про всі VM (віртуальні машини) у зручному форматі.

# 2. Фільтрація та пошук:
# Знайдіть всі VM, які розташовані в певному регіоні.
# Пошукайте VM, які мають більше ніж 16GB оперативної пам'яті.

# 3. Додавання та видалення даних:
# Додайте нову VM у файл та збережіть зміни.

# 4. Оновлення та редагування:
# Видаліть всі VM у росії та "перенесіть" їх у іншу країну та оновіть файл.
# Змініть обсяг пам'яті для всіх VM у Франції та оновіть файл.

# 5. Збереження в новий файл:
# Створіть новий JSON файл та збережіть туди інформацію лише про VM, які розташовані в певному регіоні (Азія, до прикладу).

# 6. Аналіз та Статистика:
# Знайдіть найбільш поширений обсяг пам'яті серед VM.

# 7. Застосування Умов:
# Створіть функцію, яка приймає обсяг пам'яті та повертає список VM, які мають цей обсяг.

import json

with open("virtual_machines.json", "r") as file_wrapper:
    data = json.load(file_wrapper)
    print(data)